Revit 2026 API

# EffectInstanceSetEmissiveColor Method

---

Sets the emissive color parameter of the effect instance.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEmissiveColor(
	Color color
)
```
```vb
Public Sub SetEmissiveColor (
	color As Color
)
```
```cpp
public:
void SetEmissiveColor(
	Color^ color
)
```
```fsharp
member SetEmissiveColor :
        color : Color -> unit
```

#### Parameters

color Color
     The emissive color value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace